Repository: ekchatzi/nethmmy
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: el_gr

source: Join
el_gr: Εγγραφή

source: Leave
el_gr: Αποχώρηση

source: Leave team
el_gr: Αποχώρηση από ομάδα

source: Delete team
el_gr: Διαγραφή ομάδας

source: No teams.
el_gr: Καμμία ομάδα.

source: Are you sure you want to kick this student?
el_gr: Είστε σίγουροι ότι θέλετε να αποβάλετε αυτόν τον φοιτητή;

source: Are you sure you want to delete this lab team?
el_gr: Είστε σίγουροι ότι θέλετε να διαγράψετε αυτή την ομάδα εργαστηρίου;

source: Are you sure you want to leave this lab team?
el_gr: Είστε σίγουροι ότι θέλετε να αποχωρήσετε από την ομάδα;

source: Bulk create teams
el_gr: Μαζική δημιουργία ομάδων

source: Create %s new teams
el_gr: Δημιουργήστε %s νέες ομάδες

source: Go
el_gr: Εμπρός

source: There are no registered professors
el_gr: Δεν υπάρχουν εγγεγραμμένοι καθηγητές

source: New Password
el_gr: Νέος Κωδικός

source: Code
el_gr: Κωδικός επαναφοράς

source: Reset
el_gr: Επαναφορά

source: New title
el_gr: Νέος τίτλος

source: Short title description
el_gr: Σύντομη περιγραφή τίτλου

source: Are you sure you want to delete the selected titles?
el_gr: Είστε σίγουροι ότι θέλετε να διαγράψετε τους επιλεγμένους τίτλους;

source: There are no inactive accounts.
el_gr: Δεν υπάρχουν ανενεργοί λογαριασμοί.

source: Announcements made
el_gr: Ανακοινώσεις που έγιναν

source: Email adresses validated
el_gr: Εξακριβώσεις Διευθύνσεων ηλεκτρονικού ταχυδρομείου

source: Email notifications
el_gr: Ειδοποιήσεις ηλεκτρονικού ταχυδρομείου

source: Files downloaded
el_gr: Αρχεία που κατέβηκαν

source: Files uploaded
el_gr: Αρχεία που ανέβηκαν

source: File folders created
el_gr: Φάκελοι αρχείων που δημιουργήθηκαν

source: Labs created
el_gr: Εργαστηρία που δημιουργήθηκαν

source: Lab files uploaded
el_gr: Αρχεία εργαστηρίων που ανέβηκαν

source: Lab teams created
el_gr: Ομάδες εργαστηρίου που δημιουργήθηκαν

source: Passwords changed
el_gr: Αλλαγγές κωδικού

source: User accounts created
el_gr: Λογαριασμοί χρηστών που δημιουργήθηκαν

source: No statistics.
el_gr: Δεν υπάρχουν στατιστικά.

source: Newest Announcements
el_gr: Νέες ανακοινώσεις

source: You don't have any class subscriptions.
el_gr: Δεν έχετε καμμία συνδρομή μαθημάτων.

source: No announcements yet.
el_gr: Καμμία ανακοίνωση.

source: Administrator's home
el_gr: Αρχική διαχειριστή

source: Recent activity
el_gr: Πρόσφατη δραστηριότητα

source: No log entries.
el_gr: Καμμία εισαγωγή καταγραφής.

source: Clean Log
el_gr: Καθαρισμός καταγραφών

source: Clean log and keep %s entries
el_gr: Καθαρισμός καταγραφών και διατήρηση %s εισαγωγών

source: Guest
el_gr: Επισκέπτης

source: Student
el_gr: Φοιτητής

source: Professor
el_gr: Καθηγητής

source: Admin
el_gr: Διαχειριστής

source: Manage information
el_gr: Διαχείρηση πληροφοριών

source: Make announcements
el_gr: Ανάρτηση ανακοινώσεων

source: Manage announcements
el_gr: Διαχείρηση ανακοινώσεων

source: Create labs/assignments
el_gr: Δημιουργία Εργαστηρίων/Εργασιών

source: Manage labs
el_gr: Διαχείρηση εργαστηρίων

source: Lab/assignment evaluation
el_gr: Βαθμολόγηση Εργαστηρίου/Εργασίας

source: Upload files
el_gr: Ανέβασμα αρχείων

source: Manage files
el_gr: Διαχείρηση αρχείων

source: Create quizs
el_gr: Δημιουργία quiz

source: Evaluate quizs
el_gr: Βαθμολόγηση quiz

source: File download
el_gr: Κατέβασμα αρχείων

source: File upload
el_gr: Ανέβασμα αρχείων

source: Lab file upload
el_gr: Ανέβασμα αρχείων εργαστηρίου

source: Email validation
el_gr: Εξακρίβωση ηλεκτρονικού ταχυδρομείου

source: New folder
el_gr: Νέος φάκελος

source: New lab
el_gr: Νέο εργαστήριο

source: New lab team
el_gr: Νέα ομάδα εργαστηρίου

source: New lab teams bulk
el_gr: Μαζική δημιουργία ομάδων

source: Password change
el_gr: Αλλαγές κωδικού

source: New user account
el_gr: Νέος χρήστης

source: Lab deletion
el_gr: Διαγραφή εργαστηρίου

source: Log cleanup
el_gr: Καθαρισμός καταγραφών
