Repository: ekchatzi/nethmmy
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: el_gr

source: Login
el_gr: Είσοδος

source: Register
el_gr: Εγγραφή

source: Username
el_gr: Όνομα χρήστη

source: Password
el_gr: Κωδικός

source: Home
el_gr: Αρχική

source: Logout
el_gr: Έξοδος

source: NeTHMMY
el_gr: ΝεΤΗΜΜΥ

source: Online classes application
el_gr: Εφαρμογή διαδικτυακών μαθημάτων

source: Aristotle University of Thessaloniki &copy;2012
el_gr: Αριστοτέλειο Πανεπιστήμιο Θεσσαλονίκης &copy;2012

source: Welcome to Nethmmy
el_gr: Καλώσορίσατε στο ΝεΤΗΜΜΥ

source: You are not logged in.
el_gr: Δεν είστε συνδεδεμένοι.

source: Registration success
el_gr: Εγγραφή επιτυχής

source: Passwords don't match.
el_gr: Οι κωδικοί δεν ταιριάζουν

source: Lab `%s` was created successfully.
el_gr: Το εργαστήριο `%s` δημιουργήθηκε επιτυχώς

source: Access denied.
el_gr: Απαγορεύεται η πρόσβαση.

source: Class `%s` was created successfully.
el_gr: Το μάθημα `%s` δημιουργήθηκε επιτυχώς.

source: Class was deleted successfully.
el_gr: Το μάθημα διεγράφει επιτυχώς.

source: Email address is no longer validated.
el_gr: Η διέυθυνση ηλεκτρονικού ταχυδρομείου δεν είναι πλέον εξακριβωμένη.

source: Basic information were updated successfully.
el_gr: Οι βασικές πληροφορίες ανανεώθηκαν επιτυχώς.

source: AEM was updated successfully.
el_gr: Ο ΑΕΜ ανανεώθηκε επιτυχώς.

source: Password was changed successfully.
el_gr: Ο κωδικός άλλαξε επιτυχώς.

source: Token is no longer available.
el_gr: Το token δεν είναι έγκυρο.

source: Token is invalid.
el_gr: Το token δεν είναι έγκυρο.

source: %s out of %s files were deleted successfully.
el_gr: %s από τα %s αρχεία διεγράφηκαν επιτυχώς.

source: Class updated successfully.
el_gr: Το μάθημα ανανεώθηκε επιτυχώς.

source: Association was created successfully.
el_gr: Ο συσχετισμός δημιουργήθηκε επιτυχώς.

source: Association type `%s` updated successfully.
el_gr: Ο τύπος συσχετισμού `%s` ανανεώθηκε με επιτυχία.

source: Values count do not match id count
el_gr: Ο αριθμός των ταυτοτήτων δεν ταιριάζει με αυτό των τιμών

source: %s out of %s class associations were updated successfully.
el_gr: %s από τις %s συσχετίσεις ανανεώθηκαν επιτυχώς.

source: New association type was created successfully.
el_gr: Ο νέος τύπος συσχετισμού δημιουργήθηκε με επιτυχία.

source: ethmmy class
el_gr: Μάθημα NeTHMMY

source: [ethmmy] Urgent announcement for %s
el_gr: [NeTHMMY] Επείγουσα ανακοίνωση για %s

source: Urgent delivery failed.
el_gr: Επείγουσα παράδοση απέτυχε.

source: Announcement was updated successfully.
el_gr: Η ανακοίνωση ανανεώθηκε με επιτυχία.

source: Class association was deleted successfully.
el_gr: Ο συσχετισμός διεγράφη με επιτυχία.

source: Announcement was posted succesfully.
el_gr: Η ανακοίνωση αναρτήθηκε με επιτυχία.

source: Announcement was deleted successfully.
el_gr: Η ανακοίνωση διεγράφει με επιτυχία.

source: Folder information were updated successfully.
el_gr: Οι πληροφορίες φακέλου ανανεώθηκαν επιτυχώς.

source: You are now a member of team `%s`.
el_gr: Είστε πλέον μέλος της ομάδας `%s`.

source: Folder was deleted successfully.
el_gr: Ο φάκελος διεγράγει επιτυχώς.

source: Folder is not empty.
el_gr: Ο φάκελος δεν είναι άδειος.

source: Folder was created successfully.
el_gr: Ο φάκελος δημιουργήθηκε επιτυχώς.

source: File `%s` uploaded successfully.
el_gr: Το αρχείο `%s` ανέβηκε με επιτυχία.

source: File move failed.
el_gr: Η μετακίνηση αρχείου απέτυχε.

source: Access Denied.
el_gr: Άρνηση πρόσβασης.

source: File information were updated successfully.
el_gr: Οι πληροφορίες αρχείου ανέβηκαν επιτυχώς.

source: File does not exist.
el_gr: Το αρχείο δεν υπάρχει.

source: Lab was deleted successfully.
el_gr: Το εργαστήριο διεγράφει με επιτυχία.

source: Class subscriptions were updated.
el_gr: Οι συνδρόμες μαθημάτων ανανεώθηκαν.

source: File folder was created successfully.
el_gr: Ο φάκελος αρχείων δημιουργήθηκε επιτυχώς.

source: Lab information were updated successfully.
el_gr: Οι πληροφορίες εργαστηρίου ανανεώθηκαν επιτυχώς.

source: User account was deleted successfully.
el_gr: Ο λογαριασμός χρήστη διεγράφει επιτυχώς.

source: %s out of %s titles were updated successfully.
el_gr: %s από %s τίτλους ανανεώθηκαν επιτυχώς.

source: Lab team `%s`was created successfully.
el_gr: Η ομάδα `%s` δημιουργήθηκε επιτυχώς.

source: Team limit has been reached.
el_gr: Το όριο ομάδων συμπληρώθηκε.

source: %s lab team(s) were created successfully.
el_gr: %s ομάδες δημιουργήθηκαν επιτυχώς.

source: Active status changed successfully.
el_gr: Η κατάσταση του λογαριασμού άλλαξε επιτυχώς.

source: Invalid active status.
el_gr: Μη έγκυρη κατάσταση λογαριασμού.

source: You left lab team `%s`.
el_gr: Αποχώρησες από την ομάδα `%s`.

source: Lab team `%s` was deleted.
el_gr: Η ομάδα `%s` διεγράφει.

source: Student was kicked from lab team `%s`.
el_gr: Ο φοιτητής αποβλήθηκε από την ομάδα `%s`.

source: Lab team was deleted successfully.
el_gr: Η ομάδα εργαστηρίου διεγράφει επιτυχώς.

source: Lab team was updated successfully.
el_gr: Η ομάδα ανανεώθηκε επιτυχώς.

source: Title `%s`was created successfully.
el_gr: Ο τίτλος `%s` δημιουργήθηκε επιτυχώς

source: [ethmmy] Validate your email
el_gr: [NeTHMMY] Επιβεβαιώστε το email σας

source: Please follow this link %s to validate your email address.
el_gr: Παρακαλούμε ακολουθείστε το σύνδεσμο %s για να επιβεβαιώσετε την διέυθυνση ηλεκτρονικού ταχυδρομείου σας.

source: Email validation email was sent successfully to email address `%s`.
el_gr: Ένα email εξακρίβωσης απεστάλθηκε στην διέυθυνση `%s`.

source: Message delivery failed. Please try again.
el_gr: Η παράδοση του μηνύματος απέτυχε. Δοκιμάστε ξανά.

source: Your email is already validated
el_gr: Η διεύθυνση ηλεκτρονικού ταχυδρομείου είναι ήδη εξακριβωμένη.

source: Email %s is now validated.
el_gr: Το email %s είναι πλέον επιβεβαιωμένο.

source: Deleted %s log entries.
el_gr: Διεγράφησαν %s εγγράφες καταγραφής.

source: Remote adress has been changed since last login
el_gr: Η διεύθυνση πελάτη άλλαξε από την τελευταία εισόδου

source: User not found or wrong password.
el_gr: Δεν βρέθηκε ο χρήστης ή λάθος κωδικός

source: Someone is logged in.
el_gr: Κάποιος είναι ήδη συνδεδεμένος.

source: Boolean int values values must be "0" or "1"
el_gr: Οι τιμές λογικών ακεραίων πρέπει να είναι `0` ή `1`.

source: Invalid markup
el_gr: Κακή μορφή markup.

source: Invalid semester list.
el_gr: Μη έγκυρη λίστα εξαμήνων.

source: Semester must be positive integer.
el_gr: Το εξάμηνο πρέπει να είναι θετικός ακέραιος.

source: Email is invalid.
el_gr: Το email δεν είναι έγκυρο.

source: Names must be between %s and %s characters long
el_gr: Τα ονόματα πρέπει να είναι μεταξύ %s και %s χαρακτήρες σε μήκος.

source: Name contains illegal characters.
el_gr: Το όνομα περιέχει μη έγκυρους χαρακτήρες

source: Username must be between %s and %s characters long
el_gr: Τα ονόμα χρήστη πρέπει να είναι μεταξύ %s και %s χαρακτήρες σε μήκος.

source: Username must contain only latin alphanumeric characters.
el_gr: Το όνομα χρήστη πρέπει να περιέχει μόνο λατινικούς αλφαριθμητικούς χαρακτήρες.

source: Username is taken.
el_gr: Το όνομα χρήστη είναι κατελειμένο.

source: AEM already exists.
el_gr: Το ΑΕΜ υπάρχει ήδη.

source: AEM must be positive integer.
el_gr: Το ΑΕΜ πρέπει να είναι θετικός ακέραιος.

source: Password must be between %s and %s characters long
el_gr: Ο κωδικός πρέπει να είναι μεταξύ %s και %s χαρακτήρες σε μήκος.

source: Password must contain letters AND numbers.
el_gr: Ο κωδικός πρέπει να περιέχει γράμματα ΚΑΙ αριθμούς.

source: Invalid user type.
el_gr: Μη έγκυρος τύπος χρήστη.

source: User ids must be positive integers.
el_gr: Οι ταυτότητες χρηστών πρέπει να είναι θετικοί ακέραιοι.

source: User id does not exist.
el_gr: Δε βρέθηκε ο χρήστης.

source: Database Error.
el_gr: Σφάλμα βάσης δεδομένων.

source: Class ids must be positive integers.
el_gr: Οι ταυτότητες μαθημάτων πρέπει να είναι θετικοί ακέραιοι.

source: Class id does not exist.
el_gr: Το μάθημα δεν βρέθηκε.

source: Title ids must be positive integers.
el_gr: Οι ταυτότητες τίτλων πρέπει να είναι θετικοί ακέραιοι.

source: Title id does not exist.
el_gr: Ο τίτλος δεν βρέθηκε.

source: Telephone numbers must be between %s and %s characters long or empty.
el_gr: Οι αριθμοί τηλεφώνων πρέπει να είναι μεταξύ %s και %s χαρακτήρων ή κενοί.

source: Invalid characters for telephone number.
el_gr: Μη έγκυροι χαρακτήρες για αριθμό τηλεφώνου.

source: Priority must be positive integer.
el_gr: Η προτεραιότητα πρέπει να είναι θετικός ακέραιος.

source: Invalid id list.
el_gr: Μη έγκυρη λίστα ταυτοτήτων.

source: Association type ids must be positive integers.
el_gr: Οι ταυτότητες ειδών συσχετισμών πρέπει να είναι θετικοί ακέραιοι.

source: Association type id does not exist.
el_gr: Ο τύπος συσχετισμού δεν βρέθηκε.

source: Association ids must be positive integers.
el_gr: Οι ταυτότητες συσχετισμών πρέπει να είναι θετικοί ακέραιοι.

source: Association id does not exist.
el_gr: Ο συσχετισμός δεν βρέθηκε.

source: Invalid permission "%s".
el_gr: Μη έγκυρο δικαίωμα `%s`

source: Announcement ids must be positive integers.
el_gr: Οι ταυτότητες ανακοινώσεων πρέπει να είναι θετικοί ακέραιοι.

source: Announcement id does not exist.
el_gr: Η ανακοίνωση δεν βρέθηκε.

source: Folder ids must be positive integers.
el_gr: Οι ταυτότητες φακέλων αρχείων πρέπει να είναι θετικοί ακέραιοι.

source: Folder id does not exist.
el_gr: Ο φάκελος δεν βρέθηκε.

source: File ids must be positive integers.
el_gr: Οι ταυτότητες αρχείων πρέπει να είναι θετικοί ακέραιοι.

source: File id does not exist.
el_gr: Το αρχείο δεν βρέθηκε.

source: File was not sent from form.
el_gr: Το αρχείο δεν απεστάλει από την φόρμα.

source: File is too big.
el_gr: Το αρχείο είναι πολύ μεγάλο.

source: The uploaded file was only partially uploaded.
el_gr: Το αρχείο ανέβηκε μόνο τμηματικά.

source: No file was uploaded.
el_gr: Το αρχείο δεν ανέβηκε.

source: Missing a temporary folder.
el_gr: Δεν υπάρχει προσωρινός φάκελος.

source: Failed to write file to disk.
el_gr: Αποτυχία εγγραφής στον δίσκο.

source: File error %s
el_gr: Σφάλμα αρχείου %s

source: File is too large.
el_gr: Το μέγεθος του αρχείου είναι πολύ μεγάλο.

source: File was not uploaded.
el_gr: Το αρχείο δεν ανέβηκε.

source: Timestamps must be positive integers.
el_gr: Οι χρόνοι πρέπει να είναι ακέραιοι θετικοί.

source: Lab ids must be positive integers.
el_gr: Η ταυτότητα του εργαστηρίου πρέπει να είναι θετικός ακέραιος

source: Lab id does not exist.
el_gr: Δεν βρέθηκε το εργαστήριο.

source: Lab team ids must be positive integers.
el_gr: Οι ταυτότητες ομάδων εργστηρίου πρέπει να είναι θετικοί ακέραιοι.

source: Lab team id does not exist.
el_gr: Η ομάδα εργαστηρίου δεν βρέθηκε.

source: Team limit must be positive integer.
el_gr: Το όριο ομάδων πρέπει να είναι θετικός ακέραιος.

source: Team limit too large.Must be less than %s.
el_gr: Το όριο ομάδων είναι πολύ μεγάλο. Πρέπει να είναι μικρότερο από %s.

source: Lab team user limit must be positive integer.
el_gr: Το όριο ατόμων για κάθε ομάδα πρέπει να είναι θετικός ακέραιος.

source: Lab team user limit too large.Must be less than %s.
el_gr: Το όριο ατόμων για κάθε ομάδα είναι πολύ μεγάλο. Πρέπει να είναι μικρότερο από %s.

source: Upload limit must be positive integer.
el_gr: Το όριο αποστολής αρχείων πρέπει να είναι θετικός ακέραιος.

source: Upload limit too large.Must be less than %s.
el_gr: Το όριο αποστολής αρχείων πρέπει είναι πολύ μεγάλο. Πρέπει να είναι μικρότερο από %s.

source: User #%s validated his email address.
el_gr: Ο χρήστης #%s επιβεβαίωση την διέυθυνση email του.

source: User #%s created %s team(s) for lab #%s.
el_gr: Ο χρήστης #%s δημιούργησε %s ομάδες για το εργαστήριο #%s.

source: User #%s changed his password.
el_gr: Ο χρήστης #%s άλλαξε τον κωδικό του.

source: New user #%s.
el_gr: Νέος χρήστης #%s.

source: User #%s created class #%s.
el_gr: .Ο χρήστης #%s δημιούργησε το μάθημα #%s

source: Log message type `%s` with data `%s`
el_gr: Μήνυμα καταγραφής με τύπο `%s` και δεδομένα `%s`

source: Class information
el_gr: Πληροφορίες μαθήματος

source: There is no description yet.
el_gr: Δεν υπάρχει περιγραφή

source: Classes
el_gr: Μαθήματα

source: Taught on semester(s) %s
el_gr: Διδάσκεται στο/α εξάμηνο/α %s

source: Associated professors
el_gr: Συσχετισμένοι καθηγητές

source: No associated professors.
el_gr: Κανένας συσχετισμένος καθηγητής.

source: Description
el_gr: Περιγραφή

source: Edit
el_gr: Επεξεργασία

source: Delete
el_gr: Διαγραφή

source: Are you sure you want to delete this class?
el_gr: Είστε σίγουροι ότι θέλετε να διαγράψετε αυτό το μάθημα;

source: eClasses
el_gr: eΜαθήματα

source: Class
el_gr: Μάθημα

source: Edit Class
el_gr: Επεξεργασία μαθήματος

source: New Class
el_gr: Νέο Μάθημα

source: Profile
el_gr: Προφίλ χρήστη

source: Edit Class Association Types
el_gr: Επεξεργασία τύπων συσχετισμών

source: Announcements
el_gr: Ανακοινώσεις

source: Edit Announcement
el_gr: Επεξεργασία ανακοίνωσης

source: Class Files
el_gr: Αρχεία μαθήματος

source: Folder contents
el_gr: Περιεχόμενα φακέλου

source: File information
el_gr: Πληροφορίες αρχείου

source: Lab
el_gr: Εργαστήριο

source: Edit Lab
el_gr: Επεξεργασία Εργαστηρίου

source: New Lab
el_gr: Νέο εργαστήριο

source: Edit Profile
el_gr: Επεξεργασία Προφίλ

source: Edit Titles
el_gr: Επεξεργασία τίτλων

source: Inactive accounts
el_gr: Ανενεργοί λογαριασμοί

source: Statistics
el_gr: Στατιστικά

source: Register Application
el_gr: Αίτηση εγγραφής

source: Professors
el_gr: Καθηγητές

source: Access Denied
el_gr: Άρνηση πρόσβασης.

source: Semester %s
el_gr: Εξάμηνο %s

source: No classes.
el_gr: Δεν υπάρχουν μαθήματα.

source: Set subscriptions
el_gr: Ορισμός συνδρομών

source: User Information
el_gr: Πληροφορίες χρήστη

source: Account type
el_gr: Είδος λογαριασμού

source: Your unique username
el_gr: Το όνομα εισόδου σας

source: Your login password
el_gr: Ο κωδικός πρόσβασης σας.

source: Confirm Password
el_gr: Επιβεβαίωση κωδικού

source: Your login password again
el_gr: Ο κωδικός πρόσβασης σας ξανά.

source: First Name
el_gr: Όνομα

source: Your first name
el_gr: Το όνομα σας

source: Last Name
el_gr: Επίθετο

source: Your last name
el_gr: Το επίθετο σας

source: Your email address
el_gr: Η διεύθυνση email σας

source: AEM
el_gr: Αριθμός Ειδικού Μητρώου

source: Your AEM
el_gr: Ο Αριθμός Ειδικού Μητρώου σας

source: Semester
el_gr: Εξάμηνο

source: Your current semester
el_gr: Το τρέχων σας εξάμηνο

source: Send
el_gr: Αποστολή

source: Your username has to be bigger than that.
el_gr: Το όνομα εισόδου σας πρέπει να είναι μεγαλύτερο.

source: Your password has to be bigger than that.
el_gr: Ο κωδικός σας πρέπει να είναι μεγαλύτερος.

source: Your username has to be smaller than that.
el_gr: Το όνομα εισόδου σας πρέπει να είναι μικρότερο.

source: Your password has to be smaller than that.
el_gr: Ο κωδικός σας πρέπει να είναι μικρότερος.

source: You must enter a password
el_gr: Πρέπει να δώσετε ένα κωδικό

source: Passwords must match
el_gr: Οι κωδικοί πρέπει να ταιριάζουν

source: You must enter your name
el_gr: Πρέπει να δώσετε το όνομα σας

source: You have entered an invalid name
el_gr: Έχετε δώσει ένα μη έγκυρο όνομα

source: You must enter your last name
el_gr: Πρέπει να δώσετε το επίθετο σας

source: You have entered an invalid last name
el_gr: Έχετε δώσει ένα μη έγκυρο επίθετο

source: You must enter your email
el_gr: Πρέπει να δώσετε το email σας

source: You have entered an invalid email.
el_gr: Η διέυθυνση email που δώσατε δεν είναι έγκυρη.

source: You have to enter your AEM
el_gr: Πρέπει να δώσετε το ΑΕΜ σας

source: You have entered an invalid AEM
el_gr: Έχετε δώσει μη έγκυρο ΑΕΜ

source: You have to enter your semester
el_gr: Πρέπει να δώσετε το εξάμηνο φοίτησης σας

source: You have entered an invalid semester
el_gr: Δώσατε μη έγκυρο εξάμηνο φοίτησης

source: Username already exists
el_gr: Το όνομα χρήστη υπάρχει ήδη

source: Username available
el_gr: Το όνομα χρήστη είναι διαθέσιμο

source: some user
el_gr: κάποιος χρήστης

source: Users
el_gr: Χρήστες

source: Edit profile
el_gr: Επεξεργασία προφίλ

source: User information
el_gr: Πληροφορίες χρήστη

source: Send urgent announcements to this mail
el_gr: Αποστολή επείγουσων ανακοινώσεων σε αυτό το email

source: Telephone
el_gr: Τηλέφωνο

source: Your telephone number
el_gr: Ο αριθμός τηλεφώνου σας

source: Website
el_gr: Ιστοσελίδα

source: Your personal website URL
el_gr: Το URL της προσωπικής σας ιστοσελίδας

source: Title
el_gr: Τίτλος

source: Biography
el_gr: Βιογραφικό

source: Some words about your self
el_gr: Λίγα λόγια για εσάς

source: Submit
el_gr: Αποστολή

source: Account
el_gr: Λογαριασμός

source: Active
el_gr: Ενεργός

source: Inactive
el_gr: Ανενεργός

source: Set
el_gr: Ορισμός

source: Some user
el_gr: Κάποιος χρήστης

source: Not available
el_gr: Μη διαθέσιμο

source: User
el_gr: Χρήστης

source: Common user
el_gr: Απλός χρήστης

source: Contact Info
el_gr: Πληροφορίες επικοινωνίας

source: Email sent! Please check your inbox and spam folder.
el_gr: Το email απεστάλει! Ελέξτε τα εισερχόμενα σας.

source: There is no biography yet.
el_gr: Δεν υπάρχει βιογραφικό ακόμα.

source: Associated classes
el_gr: Συσχετισμένα μαθήματα

source: None
el_gr: Κανένα

source: Account Information
el_gr: Πληροφορίες λογαριασμού

source: User ID
el_gr: ID Χρήστη

source: Registered on
el_gr: Εγγεγραμμένος από

source: Last Login on
el_gr: Τελευταία είσοδος

source: From
el_gr: Από

source: Are you sure you want to delete this user account?
el_gr: Είστε σίγουροι ότι θέλετε να διαγράψετε αυτό το λογαριασμό χρήστη;

source: New class
el_gr: Νέο μάθημα

source: Class Information
el_gr: Πληροφορίες μαθήματος

source: Class name
el_gr: Όνομα μαθήματος

source: Semesters
el_gr: Εξάμηνα

source: e.g. 2 or 6,8
el_gr: π.χ 2 ή 6,8

source: Write a description for the class
el_gr: Γράψτε μια περιγραφή για το μάθημα

source: Add
el_gr: Προσθήκη

source: Class Association Types
el_gr: Τύποι συσχετισμών

source: Delete?
el_gr: Διαγραφή;

source: Priority
el_gr: Προτεραιότητα

source: Permissions
el_gr: Δικαιώματα

source: No entries.
el_gr: Καμμία εισαγωγή

source: Apply changes
el_gr: Εφαρμογή αλλαγών

source: New association type
el_gr: Νέος τύπος συσχετισμού

source: Association Title
el_gr: Τίτλος συσχετισμού

source: Less is more important
el_gr: Οσο λιγότερο τόσο πιο σημαντικός

source: Are you sure you want to delete the selected class associations?
el_gr: Είστε σίγουροι ότι θέλετε να διαγράψετε τους επιλεγμένους συσχετισμούς;

source: Edit class
el_gr: Επεξεργασία μαθήματος

source: Class' title
el_gr: Τίτλος μαθήματος

source: Class description
el_gr: Περιγραφή μαθήματος

source: Apply
el_gr: Εφαρμογή

source: Class Associations
el_gr: Συσχετισμοί μαθημάτων

source: Type
el_gr: Τύπος

source: New association
el_gr: Νέος συσχετισμός

source: as
el_gr: ως

source: Are you sure you want to delete this class association?
el_gr: Είστε σίγουροι ότι θέλετε να διαγράψετε αυτόν τον συσχετισμό;

source: Association types
el_gr: Τύποι συσχετισμών

source: some class
el_gr: κάποιο μάθημα

source: New announcement
el_gr: Νέα ανακοίνωση

source: Announcement title here...
el_gr: Τίτλος ανακοίνωσης εδώ...

source: Urgent
el_gr: Επείγον

source: Body
el_gr: Σώμα

source: Announcement body here...
el_gr: Σώμα ανακοίνωσης

source: Post announcement
el_gr: Ανάρτηση ανακοίνωσης

source: You have to enter a title
el_gr: Πρέπει να δώσετε ένα τίτλο

source: Posted on %s by %s. Last update on %s.
el_gr: Αναρτήθηκε στις %s από %s. Τελευταία ανανέωση στις %s.

source: No announcements.
el_gr: Καμμία ανακοίνωση.

source: Are you sure you want to delete this announcement?
el_gr: Είστε σίγουροι ότι θέλετε να διαγράψετε αυτή την ανακοίνση;

source: Some class
el_gr: Κάποιο μάθημα

source: Announcement was not found
el_gr: Δεν βρέθηκε η ανακοίνωση

source: Edit announcement
el_gr: Επεξεργασία ανακοίνωσης

source: Announcement
el_gr: Ανακοίνωση

source: Announcement body...
el_gr: Σώμα ανακοίνωσης

source: Are you sure you want to delete this folder?
el_gr: Είστε σίγουροι ότι θέλετε να διαγράψετε αυτόν τον φάκελο αρχείων;

source: New Name
el_gr: Νέο Όνομα

source: New name here...
el_gr: Νέο όνομα εδώ...

source: Public
el_gr: Δημόσιος

source: Cancel
el_gr: Ακύρωση

source: No file folders.
el_gr: Κανένας φάκελος αρχείων.

source: New Folder
el_gr: Νέος φάκελος

source: Name
el_gr: Όνομα

source: Folder name here...
el_gr: Όνομα φακέλου εδώ...

source: Create folder
el_gr: Δημιουργία φακέλου

source: Files
el_gr: Αρχεία

source: Titles
el_gr: Τίτλοι

source: Association Types
el_gr: Τύποι συσχετισμών

source: Stats
el_gr: Στατιστικά

source: Administration
el_gr: Διαχείρηση

source: Folder
el_gr: Φάκελος

source: Class files
el_gr: Αρχεία μαθήματος

source: Download %s
el_gr: Κατεβάσμα %s

source: download
el_gr: κατέβασμα

source: No files.
el_gr: Δεν υπάρχουν αρχεία.

source: Are you sure you want to delete the selected file(s)?
el_gr: Είστε σίγουροι ότι θέλετε να διαγράψετε το/α επιλεγμένο/α αρχείο/α;

source: Are you sure you want to delete this file?
el_gr: Είστε σίγουροι ότι θέλετε να διαγράψετε αυτό το αρχείο;

source: Upload file
el_gr: Ανέβασμα

source: (Optional) File name here...
el_gr: (Προαιρετικό) Όνομα αρχείου εδώ...

source: File
el_gr: Αρχείο

source: Some Lab
el_gr: Κάποιο εργαστήριο

source: Database Error
el_gr: Σφάλμα βάσης δεδομένων

source: Edit Lab/assignment
el_gr: Επεξεργασία Εργαστηρίου/Εργασίας

source: Labs/Assignements
el_gr: Εργαστήρια/Εργασίες

source: Registration Deadline
el_gr: Διωρία εγγραφής

source: Hour
el_gr: Ώρα

source: Minute
el_gr: Λεπτό

source: Month
el_gr: Μήνας

source: Day of the Month
el_gr: Ημέρα του μήνα

source: Year
el_gr: Έτος

source: Lab information and settings
el_gr: Πληροφορίες εργαστηρίου και ρυθμίσεις

source: Lab title
el_gr: Τίτλος εργαστηρίου

source: Write a description for the lab
el_gr: Δώστε μια περιγραφή για το εργαστήριο

source: Team limit
el_gr: Όριο ομάδων

source: How many teams the lab can have
el_gr: Πόσες ομάδες μπορούν να δημιουργηθούν

source: Team size limit
el_gr: Όριο ατόμων

source: How many users any lab team can have
el_gr: Πόσα άτομα μπορούν να υπάρχουν σε μία ομάδα

source: Registration deadline
el_gr: Διορία εγγραφής

source: Date registrations close
el_gr: Ημερομηνία λήξης εγγραφής

source: Users can create teams
el_gr: Οι χρήστες μπορούν να φτιάξουν ομάδες

source: Users can lock their teams
el_gr: Οι χρήστες μπορούν να κλειδώσουν την ομάδα τους

source: Users can upload files
el_gr: Οι χρήστες μπορούν να ανεβάσουν αρχεία

source: Upload limit
el_gr: Όριο αποστολής αρχείων

source: How many files lab teams can upload
el_gr: Πόσα αρχεία μπορεί να ανεβάσει κάθε ομάδα

source: Upload deadline
el_gr: Διορία αποστολής αρχείων

source: Date file uploads close
el_gr: Η ημερομηνία οι αποστολές αρχείων σταματούν

source: Save changes
el_gr: Αποθήκευση αλλαγγών

source: Create Lab
el_gr: Δημιουργία εργαστηρίου

source: Registrations close on %s.
el_gr: Διορία εγγραφών %s.

source: File uploads deadline on %s.
el_gr: Διωρία αποστολής αρχείων %s.

source: Created on %s for %s and updated on %s.
el_gr: Δημιουργήθηκε στις %s για το μάθημα %s και ανανεώθηκε στις %s.

source: Created on %s.
el_gr: Δημιουργήθηκε στις %s.

source: Last updated on %s.
el_gr: Τελεύταια ανανέωση στις %s.

source: Team is %s.
el_gr: Η ομάδα είναι %s.

source: Locked
el_gr: Κλειδωμένη

source: Not Locked
el_gr: Μη κλειδωμένη

source: No students.
el_gr: Κανένας φοιτητής.

source: Kick
el_gr: Αποβολή

source: Invalid student list.
el_gr: Λάθος στην λίστα μαθητών.

source: Invalid file list.
el_gr: Λάθος στην λίστα αρχείων.

source: Are you sure you want to delete this lab?
el_gr: Είστε σίγουροι ότι θέλετε να διαγράψετε αυτό το εργαστήριο;

source: Teams
el_gr: Ομάδες

source: Create new team
el_gr: Δημιουργία νέας ομάδας

source: Go to my team
el_gr: Πήγαινε στην ομάδα μου

source: Join team
el_gr: Εγγραφή στην ομάδα
